emacs/init.org
#+PROPERTY: header-args :tangle init.el :comments org


*  My Emacs configure


** Resources

This config is mostly based on:
- [[https://github.com/syl20bnr/spacemacs][Spacemacs]]
- [[https://github.com/hlissner/doom-emacs][Doom Emacs]]
- [[https://github.com/alhassy/emacs.d][alhassy's emacs.d]]
  - Lots of interesting org configuration still to review.
- [[https://github.com/seagle0128/.emacs.d][Centaur Emacs]]
- [[https://www.sandeepnambiar.com/my-minimal-emacs-setup/][My Minimal Emacs Setup]]
- [[https://sam217pa.github.io/2016/09/02/how-to-build-your-own-spacemacs/][How to build your own spacemacs]]
- [[https://github.com/MatthewZMD/.emacs][M-EMACS]]
- [[https://blog.aaronbieber.com/2017/03/19/organizing-notes-with-refile.html][Organizing Notes With Refile]]

*** Further Resources
- [[http://emacsrocks.com/][Emacs Rocks]]
- [[https://emacscast.org][EmacsCast]]
- [[https://github.com/emacs-tw/awesome-emacs#noteworthy-configurations][Awesome Emacs]]
- [[https://www.youtube.com/channel/UCe6ABcJkH_Gso9HJOt4x9fg][Jack of Some]]
- [[http://ehneilsen.net/notebook/orgExamples/org-examples.html][Emacs org-mode examples and cookbook]]
- [[https://m00natic.github.io/emacs/emacs-wiki.html][Andrey's Opinionated Emacs Guide]]
- [[https://david.rothlis.net/emacs/howtolearn.html][How to learn Emacs]]
- [[http://ergoemacs.org/emacs/effective_emacs.html][Effective Emacs]]

** ~init.el~
To create the ~init.el~ file run ~org-babel-tangle (C-c C-v t)~.

** Install
#+BEGIN_SRC bash :tangle no
cd ~
git clone https://github.com/plexus/chemacs.git
cd chemacs
./install.sh
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle ~/.emacs-profiles.el
(("default" . ((user-emacs-directory . "~/dotfiles/emacs"))))
#+END_SRC

#+BEGIN_SRC bash :tangle ~/.emacs-profile
default
#+END_SRC

** Notes


*** use-package
- ~:diminish~ is the text that will be displayed in the modeline. To
  not clutter it we often set is as the empty string.
- ~:defer n~ is loaded after ~n~ seconds if not loaded yet. However,
  ~use-package~ is naturally lazy.

*** straight.el
- is a package manager that clones each package as a git repository and builds it locally
- this seems to be a good thing as MELP stable is not ideal
  - https://www.reddit.com/r/emacs/comments/etikbz/speaking_as_a_package_maintainer_please_do_not/
  - https://github.com/melpa/melpa/issues/6656
- plugs into use-package
- ~straight-freeze-versions~ writes the current package versions to ~straight/versions/default.el~
- to update ~straight-fetch-package-and-deps~
  
** General Emacs Setup
*** Enable Debugging
Run with debugging enabled during ~init.el~. We disable it at the end.

#+BEGIN_SRC emacs-lisp
;; only debug during init; disabled at end.
(setq debug-on-error t)
(setq debug-on-quit t)

;; show messages buffer
(with-current-buffer (messages-buffer)
  (goto-char (point-max))
  (switch-to-buffer (current-buffer)))
#+END_SRC

*** straight.el

#+BEGIN_SRC emacs-lisp
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))
#+END_SRC

*** Load ~use-package~

#+BEGIN_SRC emacs-lisp
(straight-use-package 'use-package)
(setq straight-use-package-by-default t)
#+END_SRC

*** Garbage Collector
From https://github.com/MatthewZMD/.emacs.d:
- Defer garbage collection further back in the startup process,
  according to hlissner.
  - The GC eats up quite a bit of time, easily doubling startup
    time. The trick is to turn up the memory threshold as early as
    possible.
[[https://www.reddit.com/r/emacs/comments/eewwyh/officially_introducing_memacs/][However]] (user /u/eli-zaretskii):
- The threshold should be determined by each user, by starting from
  the default and doubling the value until they feel Emacs is fast
  enough. There's no single value that will satisfy everyone.

#+BEGIN_SRC emacs-lisp
(setq gc-cons-threshold 100000000)
#+END_SRC
*** Fixes
Fix small things that cause warnings and errors. Especially on Mac OS.

#+BEGIN_SRC emacs-lisp
;; disable warnings for evil and magit
(setq ad-redefinition-action 'accept)
#+END_SRC

Ensure that on OS X the correct paths from the shell config are loaded.

#+BEGIN_SRC emacs-lisp
;; fix shell
;;(setq exec-path-from-shell-arguments '("-l"))
(use-package exec-path-from-shell
 :config (when (memq window-system '(mac ns x))
 (exec-path-from-shell-initialize)))
#+END_SRC

#+BEGIN_SRC emacs-lisp
;; fix tramp with zsh
(eval-after-load 'tramp '(setenv "SHELL" "/bin/bash"))
#+END_SRC

*** Tools
Load tools that are required for other parts of the config.

Package used for hiding modeline info. This is what is called by
~:diminish~.
#+BEGIN_SRC emacs-lisp
(use-package diminish)
#+END_SRC

String, file and list libraries.
#+BEGIN_SRC emacs-lisp
(use-package s)
(use-package f)
(use-package dash)
#+END_SRC

#+BEGIN_SRC emacs-lisp
 (use-package hydra)
#+END_SRC

Nice icons. *You need to run* ~M-x all-the-icons-install-fonts~. The
script checks if the font is installed and else runs the command.

#+BEGIN_SRC emacs-lisp
(use-package all-the-icons
    :init
    (unless (member "all-the-icons" (font-family-list))
    (all-the-icons-install-fonts t))) ;; see https://github.com/domtronn/all-the-icons.el/issues/120
(use-package all-the-icons-dired
  :hook (dired-mode . all-the-icons-dired-mode))
#+END_SRC

*** TODO Auto-Update
needs to be set up with straight 
#+BEGIN_SRC emacs-lisp
;; (use-package auto-package-update
;;   :config
;;   ;; Delete residual old versions
;;   (setq auto-package-update-delete-old-versions t)
;;   ;; Do not bother me when updates have taken place.
;;   (setq auto-package-update-hide-results t)
;;   ;; Update installed packages at startup if there is an update pending.
;;   (auto-package-update-maybe))
#+END_SRC

*** Personal Setup
#+BEGIN_SRC emacs-lisp
(setq user-full-name "Marc Fischer")
(setq user-mail-address "mail@marcfischer.at")
#+END_SRC
*** Backup
#+BEGIN_SRC emacs-lisp
;; disable auto-save files & backups
(setq auto-save-default nil
      auto-save-list-file-prefix nil
      make-backup-files nil)
;; but in case soemthing goes wrong still place them in the .emacs.d
(defvar backup-dir (expand-file-name "~/.emacs.d/emacs_backup/"))
(defvar autosave-dir (expand-file-name "~/.emacs.d/autosave/"))
#+END_SRC



*** modeline

#+BEGIN_SRC emacs-lisp
(use-package doom-modeline
      :hook (after-init . doom-modeline-mode)
      :custom
      (inhibit-compacting-font-caches t)
      (doom-modeline-minor-modes t)
      (doom-modeline-icon t)
      (doom-modeline-major-mode-color-icon t)
      (doom-modeline-height 15))
#+END_SRC


*** Text width (Fill-mode)
~M-q~ (~fill-paragraph~) justifies paragraphs and automatically breaks
them. Here we set the set standard text width.
#+BEGIN_SRC emacs-lisp
(setq-default fill-column 70) ;; 70 fits nicly on half a 13'' macbook
;; auto-fill does interfers too often
;; (add-hook 'text-mode-hook 'turn-on-auto-fill)
;; (add-hook 'org-mode-hook 'turn-on-auto-fill)
#+END_SRC

*** Theme
#+BEGIN_SRC emacs-lisp
;; Theme
(use-package doom-themes
  :config
  ;; Global settings (defaults)
  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
        doom-themes-enable-italic t) ; if nil, italics is universally disabled
  (load-theme 'doom-solarized-light t)

  ;; Enable flashing mode-line on errors
  (doom-themes-visual-bell-config)

  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config)

  ;; set font
  (set-face-attribute 'default nil :family "Ubuntu Mono" :height 150)

)

;; show linenumbers
(global-linum-mode t)
(line-number-mode t)
(column-number-mode t)
(size-indication-mode t)

;; show the matching parenthesis when the cursor is above one of them.
(setq show-paren-delay 0)
(setq show-paren-style 'mixed)
(show-paren-mode t)
(use-package smartparens
 :diminish
 :config
 (progn
   (require 'smartparens-config)
   (smartparens-global-mode 1)
   (show-paren-mode t)))

;; highlight the current line
(global-hl-line-mode t)

;; Don't clutter startup
(setq inhibit-splash-screen t)
(setq inhibit-startup-message t)

;; disable toolbars
(menu-bar-mode -1)
(toggle-scroll-bar -1)
(tool-bar-mode -1)

; display a small wave after the cursor when jumping around
(use-package beacon
   :config (beacon-mode +1))

;; disable bell sound
(setq ring-bell-function 'ignore
;;       visible-bell 1 ;; we already have the doom-theme bell setup
)

;; nice scrolling
(setq scroll-margin 0
      scroll-conservatively 100000
      scroll-preserve-screen-position 1)

;; enable y/n answers
(fset 'yes-or-no-p 'y-or-n-p)
#+END_SRC

