emacs/init.el
;; Enable Debugging
;; Run with debugging enabled during ~init.el~. We disable it at the end.


;; only debug during init; disabled at end.
(setq debug-on-error t)
(setq debug-on-quit t)

;; show messages buffer
(with-current-buffer (messages-buffer)
  (goto-char (point-max))
  (switch-to-buffer (current-buffer)))

;; straight.el


(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

;; Load ~use-package~


(straight-use-package 'use-package)
(setq straight-use-package-by-default t)

;; Garbage Collector
;; From https://github.com/MatthewZMD/.emacs.d:
;; - Defer garbage collection further back in the startup process,
;;   according to hlissner.
;;   - The GC eats up quite a bit of time, easily doubling startup
;;     time. The trick is to turn up the memory threshold as early as
;;     possible.
;; [[https://www.reddit.com/r/emacs/comments/eewwyh/officially_introducing_memacs/][However]] (user /u/eli-zaretskii):
;; - The threshold should be determined by each user, by starting from
;;   the default and doubling the value until they feel Emacs is fast
;;   enough. There's no single value that will satisfy everyone.


(setq gc-cons-threshold 100000000)

;; Fixes
;; Fix small things that cause warnings and errors. Especially on Mac OS.


;; disable warnings for evil and magit
(setq ad-redefinition-action 'accept)



;; Ensure that on OS X the correct paths from the shell config are loaded.


;; fix shell
;;(setq exec-path-from-shell-arguments '("-l"))
(use-package exec-path-from-shell
 :config (when (memq window-system '(mac ns x))
 (exec-path-from-shell-initialize)))

;; fix tramp with zsh
(eval-after-load 'tramp '(setenv "SHELL" "/bin/bash"))

;; Tools
;; Load tools that are required for other parts of the config.

;; Package used for hiding modeline info. This is what is called by
;; ~:diminish~.

(use-package diminish)



;; String, file and list libraries.

(use-package s)
(use-package f)
(use-package dash)

(use-package hydra)



;; Nice icons. *You need to run* ~M-x all-the-icons-install-fonts~. The
;; script checks if the font is installed and else runs the command.


(use-package all-the-icons
    :init
    (unless (member "all-the-icons" (font-family-list))
    (all-the-icons-install-fonts t))) ;; see https://github.com/domtronn/all-the-icons.el/issues/120
(use-package all-the-icons-dired
  :hook (dired-mode . all-the-icons-dired-mode))

;; TODO Auto-Update
;; needs to be set up with straight 

;; (use-package auto-package-update
;;   :config
;;   ;; Delete residual old versions
;;   (setq auto-package-update-delete-old-versions t)
;;   ;; Do not bother me when updates have taken place.
;;   (setq auto-package-update-hide-results t)
;;   ;; Update installed packages at startup if there is an update pending.
;;   (auto-package-update-maybe))

;; Personal Setup

(setq user-full-name "Marc Fischer")
(setq user-mail-address "mail@marcfischer.at")

;; Backup

;; disable auto-save files & backups
(setq auto-save-default nil
      auto-save-list-file-prefix nil
      make-backup-files nil)
;; but in case soemthing goes wrong still place them in the .emacs.d
(defvar backup-dir (expand-file-name "~/.emacs.d/emacs_backup/"))
(defvar autosave-dir (expand-file-name "~/.emacs.d/autosave/"))

;; Theme

;; Theme
(use-package doom-themes
  :config
  ;; Global settings (defaults)
  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
        doom-themes-enable-italic t) ; if nil, italics is universally disabled
  (load-theme 'doom-solarized-light t)

  ;; Enable flashing mode-line on errors
  (doom-themes-visual-bell-config)

  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config)

  ;; set font
  (set-face-attribute 'default nil :family "Ubuntu Mono" :height 150)
  
)

;; show linenumbers
(global-linum-mode t)
(line-number-mode t)
(column-number-mode t)
(size-indication-mode t)

;; show the matching parenthesis when the cursor is above one of them.
(setq show-paren-delay 0)
(setq show-paren-style 'mixed)
(show-paren-mode t)
(use-package smartparens
 :diminish
 :config
 (progn
   (require 'smartparens-config)
   (smartparens-global-mode 1)
   (show-paren-mode t)))

;; highlight the current line
(global-hl-line-mode t)

;; Don't clutter startup
(setq inhibit-splash-screen t)
(setq inhibit-startup-message t)

;; disable toolbars
(menu-bar-mode -1)
(toggle-scroll-bar -1)
(tool-bar-mode -1)

; display a small wave after the cursor when jumping around
(use-package beacon
   :config (beacon-mode +1))

;; disable bell sound
(setq ring-bell-function 'ignore
;;       visible-bell 1 ;; we already have the doom-theme bell setup
)

;; nice scrolling
(setq scroll-margin 0
      scroll-conservatively 100000
      scroll-preserve-screen-position 1)

;; enable y/n answers
(fset 'yes-or-no-p 'y-or-n-p)

;; modeline


(use-package doom-modeline
      :hook (after-init . doom-modeline-mode)
      :custom
      (inhibit-compacting-font-caches t)
      (doom-modeline-minor-modes t)
      (doom-modeline-icon t)
      (doom-modeline-major-mode-color-icon t)
      (doom-modeline-height 15))

;; Text width (Fill-mode)
;; ~M-q~ (~fill-paragraph~) justifies paragraphs and automatically breaks
;; them. Here we set the set standard text width.

(setq-default fill-column 70) ;; 70 fits nicly on half a 13'' macbook
;; auto-fill does interfers too often
;; (add-hook 'text-mode-hook 'turn-on-auto-fill)
;; (add-hook 'org-mode-hook 'turn-on-auto-fill)
