emacs/init.el

;; Counsel, Swiper and Ivy
;; Setup the ivy auto-complete package along with swiper
;; (ivy-text-search) and counsel (ivy-M-x).

(use-package ivy
  :diminish
  :config
  (setq ivy-use-virtual-buffers t) :init (ivy-mode 1))

(use-package counsel
  :after ivy)

(use-package swiper
  :after counsel
  :bind
  ("M-x" . counsel-M-x)
  ("\C-s" . swiper)
  ("M-s" . swiper-all)
  ("C-c C-r" . ivy-resume)
  ("C-c p" . counsel-git)
  ("C-c r" . counsel-rg)
  ("C-x C-f" . counsel-find-file)
  (("M-y" . counsel-yank-pop)
  :map ivy-minibuffer-map
  ("M-y" . ivy-next-line)) ;; multiple pressed cycles through choices; taken from http://pragmaticemacs.com/emacs/counsel-yank-pop-with-a-tweak/
)

;; Search

(use-package ripgrep
  :bind
  ("C-c C-r" . ripgrep-regexp))
(use-package ag) ;; currently not used but frequently experimented with

;; Buffers


;; use ibuffer by default
(defalias 'list-buffers 'ibuffer)

;; Indentation

;; Always stay indented: Automatically have blocks reindented after every change.
(use-package aggressive-indent
  :config (global-aggressive-indent-mode t))

;; spaces instead of tabs
(setq-default indent-tabs-mode nil)
(setq-default tab-width 2)

;; Make tab key do indent first then completion.
(setq-default tab-always-indent 'complete)

;; Parenthesis and Whitespace

(use-package whitespace
  :init
  :diminish
  :bind
  ("<f11>" . whitespace-mode)
  ("C-c w" . delete-trailing-whitespace))

;; comments

(global-set-key (kbd "M-;") 'comment-region)
(global-set-key (kbd "C-M-;") 'uncomment-region)

;; UTF-8


;; make sure that UTF-8 is used everywhere.
(set-terminal-coding-system  'utf-8)
(set-keyboard-coding-system  'utf-8)
(set-language-environment    'utf-8)
(set-selection-coding-system 'utf-8)
(setq locale-coding-system   'utf-8)
(prefer-coding-system        'utf-8)
(set-input-method nil)

;;fancy uft-8
(global-prettify-symbols-mode 1)

;; Help & Documentation
;; Display possible keys after a partial commands is entered.

(use-package which-key
  :diminish
  :config (which-key-mode)
          (setq which-key-idle-delay 0.05))



;; My own cheatsheet. Based on [[https://github.com/darksmile/cheatsheet/blob/master/cheatsheet.el][cheatsheet.el]].

(defun cheatsheet-show ()
  "Create buffer and show cheatsheet."
  (interactive)
  ;;(switch-to-buffer-other-window "*cheatsheet*")
  ;;(erase-buffer)
  (find-file (concat user-emacs-directory "CheatSheet.pdf"))
  (rename-buffer "*cheatsheet*")
  (setq buffer-read-only t))

(defun cheatsheet-toggle()
  (interactive)
  (if (get-buffer "*cheatsheet*")
    (kill-buffer "*cheatsheet*")
    (cheatsheet-show)))

(global-set-key (kbd "C-<f1>") 'cheatsheet-toggle)

;; Spellchecking

;; Taken/inspired by https://github.com/kaushalmodi/.emacs.d/blob/master/setup-files/setup-spell.el

(use-package ispell
  :if (not (bound-and-true-p disable-pkg-ispell))
  :config
  (setq ispell-program-name "aspell")
  (setq ispell-extra-args   '("--sug-mode=ultra"
                              "--lang=en_US"))

;; Save a new word to personal dictionary without asking
(setq ispell-silently-savep t))

(use-package flyspell
  :diminish
  :after ispell
  :init
  (progn
    ;; Below variables need to be set before `flyspell' is loaded.
    (setq flyspell-use-meta-tab nil)
    ;; Binding for `flyspell-auto-correct-previous-word'.
    (setq flyspell-auto-correct-binding (kbd "<S-f12>")))
  :hook ((prog-mode . flyspell-prog-mode)
           (org-mode . flyspell-mode)
           (text-mode . flyspell-mode))
)

(use-package flyspell-correct
  :after flyspell)

(defun fd-switch-dictionary()
  (interactive)
  (let* ((dic ispell-current-dictionary)
         (change (if (string= dic "deutsch8") "english" "deutsch8")))
    (ispell-change-dictionary change)
    (message "Dictionary switched from %s to %s" dic change)
    ))

;; https://github.com/d12frosted/flyspell-correct
(use-package flyspell-correct-ivy
  :after flyspell-correct
  :bind
  (("<f12>" . flyspell-correct-at-point)
   ("<f8>" .   'fd-switch-dictionary)))

;; Writegood

(use-package writegood-mode
  :hook (text-mode org-mode)
  :diminish
  :config
  (--map (push it writegood-weasel-words) ;; some words form https://github.com/alhassy/emacs.d#cosmetics
         '("some" "simple" "simply" "easy" "often" "easily" "probably" "really"
           "clearly"               ;; Is the premise undeniably true?
           "experience shows"      ;; Whose? What kind? How does it do so?
           "may have"              ;; It may also have not!
           "it turns out that")))  ;; How does it turn out so?

;; Subword
;; In CamelCase treat all words as words.


(global-subword-mode 1)
(diminish  'subword-mode)

;; Syntax Checking

(use-package flycheck
  :diminish
  :init (global-flycheck-mode)
  :custom (flycheck-display-errors-delay .3))

;; Revert Buffers

(global-set-key [f5] '(lambda () (interactive) (revert-buffer nil t nil)))

;; Server

;; Start server mode
(server-start)

;; Files

(use-package dired
  :straight f
  :custom
  ;; Auto revert
  (auto-revert-use-notify nil)
  (auto-revert-interval 3))

;; Auto complete

(use-package company
  :diminish
  :config
  (global-company-mode 1)
  (setq ;; Only 2 letters required for completion to activate.
        company-minimum-prefix-length 2

        ;; Search other buffers for compleition candidates
        company-dabbrev-other-buffers t
        company-dabbrev-code-other-buffers t

        ;; Allow (lengthy) numbers to be eligible for completion.
        company-complete-number t

        ;; M-⟪num⟫ to select an option according to its number.
        company-show-numbers t

        ;; Edge of the completion list cycles around.
        company-selection-wrap-around t

        ;; Do not downcase completions by default.
        company-dabbrev-downcase nil

        ;; Even if I write something with the ‘wrong’ case,
        ;; provide the ‘correct’ casing.
        company-dabbrev-ignore-case t

        ;; Immediately activate completion.
        company-idle-delay 0))

;; Projectile
;; Currently unused, but still here as dependency for some features (see
;; Python section).

(use-package projectile
  :diminish
  :config
  (projectile-global-mode +1))

(use-package counsel-projectile
  :diminish 
  :config
  (counsel-projectile-mode))

;; Block movement of regions
;; Move code regions up and down with ~C-S-<up>~ and ~C-S-<down>~ (similar to Eclipse).

(use-package move-text
 ;; :init (move-text-default-bindings)
 :bind
 (("C-S-<up>" . move-text-up)
  ("C-S-<down>" . move-text-down))
)

;; Expand Region

(use-package expand-region
  :bind
  ("C-@" . er/expand-region)
  ("C-=" . er/expand-region)
)

;; Movement
