emacs/init.org
*** Movement
#+BEGIN_SRC emacs-lisp
(use-package windmove
  :bind
  ("C-c <up>" . windmove-up)
  ("C-c <down>" . windmove-down)
  ("C-c <left>" . windmove-left)
  ("C-c <right>" . windmove-right))

(use-package ace-window
  :init
  (progn
    (global-set-key (kbd "M-o") 'ace-window)
    (global-set-key (kbd "<f9>") 'ace-window))
  :config
    (set-face-attribute
     'aw-leading-char-face nil
     :foreground "deep sky blue"
     :weight 'bold
     :height 3.0)
    (set-face-attribute
     'aw-mode-line-face nil
     :inherit 'mode-line-buffer-id
     :foreground "lawn green")
    (setq aw-keys '(?a ?s ?d ?f ?j ?k ?l)
          aw-dispatch-always t
          aw-dispatch-alist
          '((?x aw-delete-window "Ace - Delete Window")
            (?c aw-swap-window "Ace - Swap Window")
            (?n aw-flip-window)
            (?v aw-split-window-vert "Ace - Split Vert Window")
            (?h aw-split-window-horz "Ace - Split Horz Window")
            (?m delete-other-windows "Ace - Maximize Window")
            (?g delete-other-windows)
            (?b balance-windows)))

    (defhydra hydra-window-size (:color red)
         "Windows size"
         ("h" shrink-window-horizontally "shrink horizontal")
         ("j" shrink-window "shrink vertical")
         ("k" enlarge-window "enlarge vertical")
         ("l" enlarge-window-horizontally "enlarge horizontal"))
    (defhydra hydra-window-frame (:color red)
         "Frame"
         ("f" make-frame "new frame")
         ("x" delete-frame "delete frame"))
    (defhydra hydra-window-scroll (:color red)
         "Scroll other window"
         ("n" joe-scroll-other-window "scroll")
         ("p" joe-scroll-other-window-down "scroll down"))
       (add-to-list 'aw-dispatch-alist '(?w hydra-window-size/body) t)
       (add-to-list 'aw-dispatch-alist '(?o hydra-window-scroll/body) t)
       (add-to-list 'aw-dispatch-alist '(?\; hydra-window-frame/body) t)
     (ace-window-display-mode t))
#+END_SRC

#+BEGIN_SRC emacs-lisp
;; make C-a move to the beginning of the line on first press; on further presses go to beginning of code
;; same for C-e and end
(use-package mwim
  :bind
  ("C-a" . mwim-beginning)
  ("C-e" . mwim-end))
#+END_SRC

#+BEGIN_SRC emacs-lisp
;; Unbind unneeded keys
(global-set-key (kbd "C-z") nil)
(use-package avy
  :bind
  (("C-z c" . avy-goto-char-timer)
   ("C-z l" . avy-goto-line))
  :custom
    (avy-timeout-seconds 0.3)
    (avy-style 'pre)
  :custom-face
    (avy-lead-face ((t (:background "#51afef" :foreground "#870000" :weight bold)))));
#+END_SRC


*** Undo
Copied from https://github.com/alhassy/emacs.d
#+BEGIN_SRC emacs-lisp
;; Allow tree-semantics for undo operations.
(use-package undo-tree
  :diminish                       ;; Don't show an icon in the modeline
  :config
    ;; Always have it on
    (global-undo-tree-mode)

    ;; Each node in the undo tree should have a timestamp.
    (setq undo-tree-visualizer-timestamps t)

    ;; Show a diff window displaying changes between undo nodes.
    (setq undo-tree-visualizer-diff t))

;; Execute (undo-tree-visualize) then navigate along the tree to witness
;; changes being made to your file live!
#+END_SRC


*** iedit, multiple cursors
See:
- https://emacs.stackexchange.com/questions/47821/iedit-vs-multiple-cursors

#+BEGIN_SRC emacs-lisp
(use-package iedit
  :bind (("C-c i" . iedit-mode)))
#+END_SRC

** Modes

*** org mode

#+BEGIN_SRC emacs-lisp
;; ensure the correct org package is used for all the following
(straight-use-package 'org-plus-contrib)
#+END_SRC

**** org recur

#+BEGIN_SRC emacs-lisp
(defun marcfischer-init-org-recur-init()
  (setq ;; Make org and org-recur work nicely
        ;; Log time a task was set to Done.
        org-log-done (quote time)
        ;; Don't log the time a task was rescheduled or redeadlined.
        org-log-redeadline nil
        org-log-reschedule nil
        org-read-date-prefer-future 'time
        )
)

;; make org play well with org recur
;; Refresh org-agenda after rescheduling a task.
(defun marcfischer-init-org-agenda-refresh ()
  "Refresh all `org-agenda' buffers."
  (dolist (buffer (buffer-list))
    (with-current-buffer buffer
      (when (derived-mode-p 'org-agenda-mode)
        (org-agenda-maybe-redo)))))

(defun marcfischer-init-org-recur-config ()
  (defadvice org-schedule (after refresh-agenda activate)
  "Refresh org-agenda."
  (marcfischer-init-org-agenda-refresh))
)

(use-package org-recur
:after org
  :hook ((org-mode . org-recur-mode)
         (org-agenda-mode . org-recur-agenda-mode))
  :demand t
  :init
  (setq org-recur-finish-done t
        org-recur-finish-archive t)
  :config
  (define-key org-recur-mode-map (kbd "C-c d") 'org-recur-finish)
  ;; Rebind the 'd' key in org-agenda (default: `org-agenda-day-view').
  (define-key org-recur-agenda-mode-map (kbd "d") 'org-recur-finish)
  (define-key org-recur-agenda-mode-map (kbd "C-c d") 'org-recur-finish))
#+END_SRC

**** org refile

#+BEGIN_SRC emacs-lisp
(defun marcfischer-init-org-refile-config()
  ;; refile setup
  (setq org-refile-targets '((org-agenda-files :maxlevel . 2)) ;; show two levels of headings
        org-refile-allow-creating-parent-nodes 'confirm        ;; allow to create new nodes
        org-refile-use-outline-path 'file                      ;; allow to file to top level of files
        org-outline-path-complete-in-steps nil                 ;; present all possilbe paths at once
        )
)
#+END_SRC

**** org babel

***** python
[[https://orgmode.org/worg/org-contrib/babel/languages/ob-doc-python.html][[Documentation]​]]

Use the following header arguments:
- ~:results {output, value}~: Value mode is the default (as with other languages). In value mode you can use the following subtypes:
  - ~raw~: value is inserted directly
  - ~pp~: value is pretty-printed by python using pprint.pformat(%s), then inserted
  - ~file~: value is interpreted as a filename to be interpolated when exporting; commonly used for graphics output.
- ~:return~: Value to return (only when result-type is value, and not in session mode; not commonly used). Default is None; in non-session mode use return() to return a value.
- ~:python~: Name of the command for executing Python code.
- ~:session [name]~: default is no session.
~:var data=data-table~: Variables can be passed into python from org-mode tables as scalars or lists. See the org-mode manual for more details.
~:exports {code, results, both, none}~: Standard babel option for what to export.


 #+BEGIN_SRC emacs-lisp
(defun marcfischer-init-org-babel-config()
  ;; enable python in org babel
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((python . t)))
)
 #+END_SRC

**** file sync

#+BEGIN_SRC emacs-lisp
;; Try to minimize org sync conflicts by autosaving (https://christiantietze.de/posts/2019/03/sync-emacs-org-files/)
;; redefine org-save-all-org-buffers without print statements
(defun marcfischer-init-org-save-all-org-buffers ()
  "Save all Org buffers without user confirmation."
  (interactive)
  (save-some-buffers t (lambda () (derived-mode-p 'org-mode)))
  (when (featurep 'org-id) (org-id-locations-save)))

(defun marcfischer-init-org-sync-config ()
  (add-hook 'auto-save-hook 'marcfischer-init-org-save-all-org-buffers) ;; enable autosaves
)
#+END_SRC

**** org noter
#+BEGIN_SRC emacs-lisp
(use-package org-noter
    :after org
    :config
    (setq org-noter-always-create-frame nil
          org-noter-insert-note-no-questions t
          org-noter-separate-notes-from-heading t
          org-noter-auto-save-last-location t))
#+END_SRC


