emacs/init.el

;; setup org agenda

(setq org-agenda-span 7 ;; show 7 days 
      org-agenda-start-on-weekday nil  ;; start from current day (rather than monday)
      org-agenda-start-day "-1d") ;; show 1 day beforet

;; add super aggenda 
(use-package org-super-agenda
  :after org
  :config
  (org-super-agenda-mode)

(setq org-agenda-custom-commands
      '(("c" "Super Agenda" agenda
         (org-super-agenda-mode)
         ((org-super-agenda-groups
           '(
             (:name "Today"
                    :time-grid t
                    :scheduled today)
             (:name "Overdue"
                    :scheduled past)
             )))
         (org-agenda nil "a")))))

;; org zotxt

(use-package org-zotxt
  :straight zotxt
  :diminish
  :after org
  :init (add-hook 'org-mode-hook 'org-zotxt-mode)
)

;; org-ref (with zotero integration)


;; zotero pdf support
;; https://github.com/jkitchin/org-ref/blob/4f26ac56db785b4bff05e75ae7decc44be2ba89e/org-ref.org
(defun my/org-ref-open-pdf-at-point ()
  "Open the pdf for bibtex key under point if it exists."
  (interactive)
  (let* ((results (org-ref-get-bibtex-key-and-file))
         (key (car results))
	 (pdf-file (car (bibtex-completion-find-pdf key))))
    (if (file-exists-p pdf-file)
	(org-open-file pdf-file)
      (message "No PDF found for %s" key))))

(use-package org-ref
  :after org
  :config
  (setq reftex-default-bibliography '("~/org/bibliography/zotero.bib")
  org-ref-bibliography-notes "~/org/bibliography/notes.org"
  org-ref-default-bibliography '("~/org/bibliography/zotero.bib")
  org-ref-pdf-directory "~/org/bibliography/pdfs/"
  org-ref-open-pdf-function 'my/org-ref-open-pdf-at-point
  org-ref-completion-library 'org-ref-ivy-cite)
)

;; org capture

;; See:
;; - https://orgmode.org/manual/Capture-templates.html
;; - https://cestlaz.github.io/posts/using-emacs-23-capture-1/
;; - consider switching to https://github.com/progfolio/doct


(defun marcfischer-init-org-capture-config()
  (global-set-key (kbd "C-c c") 'org-capture)
)

(setq org-capture-templates
'(("i" "in" entry (file "~/org/in.org") "* %?\n")
("t" "todo" entry (file "~/org/in.org") "* TODO %? %^g \n SCHEDULED: %^t \n")
("c" "cooking" entry (file "~/org/cooking.org") "* %?\n")
("r" "reading" entry (file "~/org/read.org") "* %?\n")
("m" "media [music, games, movies, recreational books] to consider" entry (file+headline "~/org/media.org" "To check out") "** %? %^g\n")
("o" "quote" entry (file "~/org/quotes.org") "* %^{quote}\n:PROPERTIES:\n:BY: %^{by}\n:FROM: %^{from}\n:END:" :empty-lines 1)


))

;; notes (org-journal; org-roam)

;; See:
;; - [[file:../../Dropbox/org/notes/20200216212922.org][How To Take Smart Notes With Org-mode]]
;; - https://org-roam.readthedocs.io/en/develop/
;; - https://github.com/bastibe/org-journal
;; - https://blog.jethro.dev/posts/introducing_org_roam/


(use-package org-journal
  :after org
  :defer t
  :custom
  (org-journal-dir "~/org/notes/")
  (org-journal-date-format "%A, %d %B %Y"))

(use-package org-roam
      :after org
      :hook 
      ((org-mode . org-roam-mode)
       (after-init . org-roam--build-cache-async) ;; optional!
       )
      :straight (:host github :repo "jethrokuan/org-roam" :branch "master")
      :custom
      (org-roam-directory "~/org/notes")
      :bind
      ("C-c n l" . org-roam)
      ("C-c n t" . org-roam-today)
      ("C-c n f" . org-roam-find-file)
      ("C-c n i" . org-roam-insert)
      ("C-c n g" . org-roam-show-graph))

;; other


;; (defun org-toggle-link-display ()
;;   "Toggle the literal or descriptive display of links."
;;   (interactive)
;;   (if org-descriptive-links
;;       (progn (org-remove-from-invisibility-spec '(org-link))
;;          (org-restart-font-lock)
;;          (setq org-descriptive-links nil))
;;     (progn (add-to-invisibility-spec '(org-link))
;;        (org-restart-font-lock)
;;        (setq org-descriptive-links t))))

;; load everything


(use-package org
  :straight org-plus-contrib ;; load the full package with contrib code
  :init
  (setq org-agenda-files '("~/org/")
	      org-catch-invisible-edits 'show
	      org-confirm-babel-evaluate nil ;; run without confirmation
	      org-src-preserve-indentation t ;; preserve indentation at export
        org-image-actual-width nil
        org-agenda-window-setup 'only-window ;; make sure that agenda uses fullscreen
	      org-highlight-latex-and-related '(latex))
  (marcfischer-init-org-recur-init)

  :bind ("\C-c a" . org-agenda)
  :config

  ;; Allow the :ignore: to ignore headers in exporing
  (require 'ox-extra)
  (ox-extras-activate '(ignore-headlines))
  (marcfischer-init-org-recur-config)
  (marcfischer-init-org-refile-config)
  (marcfischer-init-org-babel-config)
  (marcfischer-init-org-sync-config)
  ;;(marcfischer-init-org-display-agenda-config)
  (marcfischer-init-org-capture-config)
)

;; Integrate org-bibtex with org-roam (org-roam-bibtex)

(use-package org-roam-bibtex
:after (org-roam org-ref)
:hook (org-roam-mode . org-roam-bibtex-mode)
:bind (:map org-mode-map
       (("C-c n a" . orb-note-actions)))
)

;; Ledger

;; ledger mode
(use-package ledger-mode)

;; git

(use-package magit)

;; C++


;; also use c++ mode for cuda files
(add-to-list 'auto-mode-alist '("\\.cu\\'" . c++-mode))

;; Eglot


(use-package eglot
  :diminish t
  :hook
  ;;(c-mode . eglot-ensure)
  ;;(c++-mode . eglot-ensure)
  (js-mode . eglot-ensure)
  (jsx-mode . eglot-ensure)
  (js-mode . eglot-ensure)
  (typescript-mode . eglot-ensure)
    ;;(python-mode . eglot-ensure)
)

;; Typescript


(use-package typescript-mode
  :diminish t)

;; SCSS


(use-package scss-mode
  :diminish t)

;; python
