emacs/init.el


(use-package markdown-mode
  :ensure t
  :mode ("\\.md\\'" . gfm-mode)
  :commands (markdown-mode gfm-mode)
  :config
  (setq markdown-command "pandoc -t html5")t)

;; Disable debugging

;; Disable debugging
(setq debug-on-error nil)
(setq debug-on-quit nil)

;; Say we are Done

(message "init done")
